imbluedabr/m33mu/cpu/mcxn947/mcxn947_secure.c
/* m33mu -- an ARMv8-M Emulator
 *
 * SPDX-License-Identifier: AGPL-3.0-or-later
 */
#include <string.h>
#include <stdlib.h>
#include <stdio.h>

#include "mcxn947/mcxn947_secure.h"
#include "mcxn947/mcxn947_mmio.h"
#include "m33mu/mmio.h"
#include "m33mu/memmap.h"

#ifdef M33MU_HAS_WOLFSSL
#include <wolfssl/options.h>
#include <wolfssl/wolfcrypt/settings.h>
#include <wolfssl/wolfcrypt/sha256.h>
#include <wolfssl/wolfcrypt/hmac.h>
#endif

#define MCXN947_PUF_BASE    0x40024000u
#define MCXN947_OTPC_BASE   0x40025000u
#define MCXN947_ELS_BASE    0x40026000u
#define MCXN947_PKC_BASE    0x4002B000u
#define MCXN947_PRINCE_BASE 0x4002C000u
#define MCXN947_SEC_ALIAS   0x10000000u
#define MCXN947_SEC_SIZE    0x1000u

#define SEC_REG_CMD        0x000u
#define SEC_REG_STATUS     0x004u
#define SEC_REG_ARG0       0x008u
#define SEC_REG_ARG1       0x00Cu
#define SEC_REG_ARG2       0x010u
#define SEC_REG_ARG3       0x014u
#define SEC_REG_RESULT0    0x020u
#define SEC_REG_RESULT1    0x024u
#define SEC_REG_RESULT2    0x028u
#define SEC_REG_RESULT3    0x02Cu
#define SEC_REG_KEYIN0     0x080u
#define SEC_REG_KEYIN1     0x084u
#define SEC_REG_KEYIN2     0x088u
#define SEC_REG_KEYIN3     0x08Cu
#define SEC_REG_DATA0      0x100u
#define SEC_REG_DATA1      0x104u
#define SEC_REG_DATA2      0x108u
#define SEC_REG_DATA3      0x10Cu

#define SEC_STATUS_BUSY    (1u << 0)
#define SEC_STATUS_DONE    (1u << 1)
#define SEC_STATUS_ERROR   (1u << 2)
#define SEC_STATUS_SECURE  (1u << 3)

#define PUF_CMD_ENROLL     0x1u
#define PUF_CMD_DERIVE     0x2u

#define ELS_CMD_GENERATE   0x1u
#define ELS_CMD_DERIVE     0x2u
#define ELS_CMD_IMPORT     0x3u
#define ELS_CMD_SIGN       0x4u
#define ELS_CMD_VERIFY     0x5u
#define ELS_CMD_ATTEST     0x6u
#define ELS_CMD_RNG        0x7u

#define PKC_CMD_SIGN       0x1u
#define PKC_CMD_VERIFY     0x2u
#define PKC_CMD_KEYGEN     0x3u

#define OTPC_CMD_PROGRAM   0x1u

#define PRINCE_CMD_CONFIG  0x1u

#define MCXN947_OTP_WORDS  128u
#define MCXN947_ELS_SLOTS  8u

struct mcxn947_secure_regs {
    mm_u32 cmd;
    mm_u32 status;
    mm_u32 arg[4];
    mm_u32 result[4];
    mm_u32 keyin[4];
    mm_u32 data[4];
};

struct mcxn947_secure_slot {
    mm_bool valid;
    mm_u32 permissions;
    mm_u8 key[32];
};

struct mcxn947_secure_persist {
    mm_bool initialized;
    mm_bool preserve_identity;
    mm_u8 uds[32];
    mm_u32 otp[MCXN947_OTP_WORDS];
    mm_u8 puf_master[32];
    struct mcxn947_secure_slot slots[MCXN947_ELS_SLOTS];
};

struct mcxn947_secure_state {
    struct mcxn947_secure_regs puf;
    struct mcxn947_secure_regs els;
    struct mcxn947_secure_regs pkc;
    struct mcxn947_secure_regs otpc;
    struct mcxn947_secure_regs prince;
    struct mcxn947_secure_persist persist;
    mm_u8 *flash;
    mm_u32 flash_size;
    mm_u32 lifecycle;
    mm_u32 att_seed;
    mm_u32 nonce;
    mm_bool puf_enrolled;
    mm_u8 measurement[32];
    mm_u8 cdi[32];
    mm_u8 attest_pubkey[32];
    mm_u8 attest_sig[32];
};

enum mcxn947_secure_block {
    MCXN947_BLOCK_PUF = 0,
    MCXN947_BLOCK_OTPC = 1,
    MCXN947_BLOCK_ELS = 2,
    MCXN947_BLOCK_PKC = 3,
    MCXN947_BLOCK_PRINCE = 4
};

static struct mcxn947_secure_state g_sec;

static mm_u32 read32le(const mm_u8 *buf)
{
    return ((mm_u32)buf[0]) |
           ((mm_u32)buf[1] << 8u) |
           ((mm_u32)buf[2] << 16u) |
           ((mm_u32)buf[3] << 24u);
}

static void write32le(mm_u8 *buf, mm_u32 value)
{
    buf[0] = (mm_u8)(value & 0xffu);
    buf[1] = (mm_u8)((value >> 8u) & 0xffu);
    buf[2] = (mm_u8)((value >> 16u) & 0xffu);
    buf[3] = (mm_u8)((value >> 24u) & 0xffu);
}

#ifdef M33MU_HAS_WOLFSSL
static void secure_sha256(mm_u8 out[32], const mm_u8 *data, mm_u32 len)
{
    wc_Sha256 sha;
    wc_InitSha256(&sha);
    wc_Sha256Update(&sha, data, len);
    wc_Sha256Final(&sha, out);
}

static void secure_hmac(mm_u8 out[32], const mm_u8 *key, mm_u32 key_len,
                        const mm_u8 *data, mm_u32 len)
{
    Hmac hmac;
    wc_HmacInit(&hmac, 0, INVALID_DEVID);
    wc_HmacSetKey(&hmac, WC_SHA256, key, key_len);
    wc_HmacUpdate(&hmac, data, len);
    wc_HmacFinal(&hmac, out);
    wc_HmacFree(&hmac);
}
#else
static void secure_sha256(mm_u8 out[32], const mm_u8 *data, mm_u32 len)
{
    mm_u32 acc;
    mm_u32 i;
    mm_u32 j;
    acc = 0x811C9DC5u;
    for (i = 0u; i < len; ++i) {
        acc ^= data[i];
        acc *= 16777619u;
        acc = (acc << 5u) | (acc >> 27u);
    }
    for (j = 0u; j < 32u; j += 4u) {
        acc ^= (0x9E3779B9u + j);
        acc *= 2246822519u;
        write32le(out + j, acc);
    }
}

static void secure_hmac(mm_u8 out[32], const mm_u8 *key, mm_u32 key_len,
                        const mm_u8 *data, mm_u32 len)
{
    mm_u8 buf[96];
    mm_u32 copy;
    copy = (key_len > 32u) ? 32u : key_len;
    memset(buf, 0, sizeof(buf));
    memcpy(buf, key, copy);
    if (len > 64u) len = 64u;
    memcpy(buf + 32u, data, len);
    secure_sha256(out, buf, 32u + len);
}
#endif

static void secure_mix_label(mm_u8 out[32], const mm_u8 *seed,
                             const char *label, mm_u32 a, mm_u32 b)
{
    mm_u8 buf[96];
    size_t label_len;
    memset(buf, 0, sizeof(buf));
    memcpy(buf, seed, 32u);
    label_len = strlen(label);
    if (label_len > 48u) label_len = 48u;
    memcpy(buf + 32u, label, label_len);
    write32le(buf + 80u, a);
    write32le(buf + 84u, b);
    secure_sha256(out, buf, 88u);
}

static mm_u32 secure_parse_hex_nibble(char c)
{
    if (c >= '0' && c <= '9') return (mm_u32)(c - '0');
    if (c >= 'a' && c <= 'f') return (mm_u32)(c - 'a' + 10);
    if (c >= 'A' && c <= 'F') return (mm_u32)(c - 'A' + 10);
    return 0xFFFFFFFFu;
}

static mm_bool secure_parse_hex32(const char *hex, mm_u8 out[32])
{
    mm_u32 i;
    if (hex == 0) return MM_FALSE;
    if (strlen(hex) != 64u) return MM_FALSE;
    for (i = 0u; i < 32u; ++i) {
        mm_u32 hi = secure_parse_hex_nibble(hex[i * 2u]);
        mm_u32 lo = secure_parse_hex_nibble(hex[i * 2u + 1u]);
        if (hi > 0xFu || lo > 0xFu) return MM_FALSE;
        out[i] = (mm_u8)((hi << 4u) | lo);
    }
    return MM_TRUE;
}

static mm_u32 secure_env_u32(const char *name, mm_u32 fallback)
{
    const char *value;
    char *end;
    unsigned long parsed;
    value = getenv(name);
    if (value == 0 || value[0] == '\0') return fallback;
    parsed = strtoul(value, &end, 0);
    if (end == value) return fallback;
    return (mm_u32)parsed;
}

static mm_bool secure_env_bool(const char *name, mm_bool fallback)
{
    const char *value;
    value = getenv(name);
    if (value == 0 || value[0] == '\0') return fallback;
    if (strcmp(value, "0") == 0 || strcmp(value, "false") == 0) return MM_FALSE;
    if (strcmp(value, "1") == 0 || strcmp(value, "true") == 0) return MM_TRUE;
    return fallback;
}

static mm_u32 secure_lifecycle_from_env(void)
{
    const char *value;
    value = getenv("M33MU_MCXN947_LIFECYCLE");
    if (value == 0 || value[0] == '\0') return MCXN947_LCS_DM;
    if (strcmp(value, "cm") == 0) return MCXN947_LCS_CM;
    if (strcmp(value, "dm") == 0) return MCXN947_LCS_DM;
    if (strcmp(value, "se") == 0) return MCXN947_LCS_SE;
    if (strcmp(value, "rma") == 0) return MCXN947_LCS_RMA;
    return secure_env_u32("M33MU_MCXN947_LIFECYCLE", MCXN947_LCS_DM) & 0x3u;
}

