imbluedabr/m33mu/cpu/mcxn947/mcxn947_secure.c
static void secure_build_defaults(struct mcxn947_secure_state *s)
{
    const char *uds_hex;
    mm_u8 seed[32];
    uds_hex = getenv("M33MU_MCXN947_UDS_HEX");
    if (!s->persist.initialized || !s->persist.preserve_identity) {
        memset(&s->persist, 0, sizeof(s->persist));
        s->persist.preserve_identity = secure_env_bool("M33MU_MCXN947_PRESERVE_IDENTITY", MM_TRUE);
    }
    if (!s->persist.initialized) {
        memset(seed, 0, sizeof(seed));
        memcpy(seed, "m33mu-mcxn947-default-uds", 24u);
        if (uds_hex == 0 || !secure_parse_hex32(uds_hex, s->persist.uds)) {
            secure_sha256(s->persist.uds, seed, sizeof(seed));
        }
        secure_mix_label(s->persist.puf_master, s->persist.uds, "puf-master", 0u, 0u);
        s->persist.otp[0] = 0x4D43584Eu;
        s->persist.otp[1] = 0x00000947u;
        s->persist.otp[25] = 0u;
        s->persist.otp[43] = 0x01010101u;
        s->persist.initialized = MM_TRUE;
    }
    s->lifecycle = secure_lifecycle_from_env();
    s->att_seed = secure_env_u32("M33MU_MCXN947_ATTEST_SEED", 0x947A11u);
}

static void secure_measure_flash(struct mcxn947_secure_state *s)
{
    mm_u8 header[16];
    mm_u32 use_len;
    memset(header, 0, sizeof(header));
    write32le(header + 0u, s->flash_size);
    write32le(header + 4u, s->lifecycle);
    write32le(header + 8u, s->persist.otp[25]);
    write32le(header + 12u, s->att_seed);
    if (s->flash == 0 || s->flash_size == 0u) {
        secure_sha256(s->measurement, header, sizeof(header));
        return;
    }
    use_len = s->flash_size;
    if (use_len > 0x10000u) use_len = 0x10000u;
    secure_sha256(s->measurement, s->flash, use_len);
    secure_hmac(s->measurement, s->measurement, 32u, header, sizeof(header));
}

static void secure_refresh_identity(struct mcxn947_secure_state *s)
{
    mm_u8 material[64];
    secure_measure_flash(s);
    memset(material, 0, sizeof(material));
    memcpy(material, s->measurement, 32u);
    write32le(material + 32u, s->lifecycle);
    write32le(material + 36u, s->persist.otp[25]);
    write32le(material + 40u, s->att_seed);
    secure_hmac(s->cdi, s->persist.uds, 32u, material, 44u);
    secure_mix_label(s->attest_pubkey, s->cdi, "idk-pub", s->lifecycle, s->persist.otp[25]);
    secure_hmac(s->attest_sig, s->cdi, 32u, s->measurement, 32u);
}

static void secure_reset_regs(struct mcxn947_secure_regs *r)
{
    memset(r, 0, sizeof(*r));
    r->status = SEC_STATUS_SECURE;
}

static void secure_finish(struct mcxn947_secure_regs *r, mm_bool ok)
{
    r->status &= ~SEC_STATUS_BUSY;
    r->status &= ~SEC_STATUS_DONE;
    r->status &= ~SEC_STATUS_ERROR;
    r->status |= ok ? SEC_STATUS_DONE : SEC_STATUS_ERROR;
}

static void secure_regs_writeback(struct mcxn947_secure_regs *r,
                                  const mm_u8 digest[32])
{
    r->result[0] = read32le(digest + 0u);
    r->result[1] = read32le(digest + 4u);
    r->result[2] = read32le(digest + 8u);
    r->result[3] = read32le(digest + 12u);
    r->data[0] = read32le(digest + 16u);
    r->data[1] = read32le(digest + 20u);
    r->data[2] = read32le(digest + 24u);
    r->data[3] = read32le(digest + 28u);
}

static mm_bool secure_slot_in_range(mm_u32 slot)
{
    return slot < MCXN947_ELS_SLOTS ? MM_TRUE : MM_FALSE;
}

static void secure_exec_puf(struct mcxn947_secure_state *s)
{
    mm_u8 seed[32];
    mm_u32 slot;
    slot = s->puf.arg[0];
    if (s->puf.cmd == PUF_CMD_ENROLL) {
        s->puf_enrolled = MM_TRUE;
        s->puf.result[0] = 1u;
        s->puf.result[1] = 0x50554631u;
        secure_finish(&s->puf, MM_TRUE);
        return;
    }
    if (s->puf.cmd != PUF_CMD_DERIVE || !s->puf_enrolled || !secure_slot_in_range(slot)) {
        secure_finish(&s->puf, MM_FALSE);
        return;
    }
    memset(seed, 0, sizeof(seed));
    write32le(seed + 0u, slot);
    write32le(seed + 4u, s->puf.keyin[0]);
    write32le(seed + 8u, s->puf.keyin[1]);
    write32le(seed + 12u, s->puf.keyin[2]);
    write32le(seed + 16u, s->puf.keyin[3]);
    secure_hmac(s->persist.slots[slot].key, s->persist.puf_master, 32u, seed, 20u);
    s->persist.slots[slot].valid = MM_TRUE;
    s->persist.slots[slot].permissions = 0xFFFFFFFFu;
    s->puf.result[0] = 0xCAFE0000u | slot;
    s->puf.result[1] = read32le(s->persist.slots[slot].key + 0u);
    s->puf.result[2] = read32le(s->persist.slots[slot].key + 4u);
    s->puf.result[3] = read32le(s->persist.slots[slot].key + 8u);
    secure_finish(&s->puf, MM_TRUE);
}

static mm_bool secure_els_sign_from_slot(mm_u32 slot, const mm_u8 *msg,
                                         mm_u32 len, mm_u8 sig_out[32])
{
    if (!secure_slot_in_range(slot)) return MM_FALSE;
    if (!g_sec.persist.slots[slot].valid) return MM_FALSE;
    secure_hmac(sig_out, g_sec.persist.slots[slot].key, 32u, msg, len);
    return MM_TRUE;
}

static void secure_exec_els(struct mcxn947_secure_state *s)
{
    mm_u32 slot;
    mm_u8 msg[32];
    mm_u8 sig[32];
    struct mcxn947_attestation_blob blob;
    slot = s->els.arg[0];
    memset(msg, 0, sizeof(msg));
    write32le(msg + 0u, s->els.keyin[0]);
    write32le(msg + 4u, s->els.keyin[1]);
    write32le(msg + 8u, s->els.keyin[2]);
    write32le(msg + 12u, s->els.keyin[3]);
    if (!mm_mcxn947_secure_els_clock_ready()) {
        secure_finish(&s->els, MM_FALSE);
        return;
    }
    switch (s->els.cmd) {
    case ELS_CMD_GENERATE:
        if (!secure_slot_in_range(slot)) {
            secure_finish(&s->els, MM_FALSE);
            return;
        }
        secure_mix_label(s->persist.slots[slot].key, s->cdi, "els-generate", slot, s->nonce++);
        s->persist.slots[slot].valid = MM_TRUE;
        s->persist.slots[slot].permissions = 0xFFFFFFFFu;
        secure_regs_writeback(&s->els, s->persist.slots[slot].key);
        secure_finish(&s->els, MM_TRUE);
        return;
    case ELS_CMD_DERIVE:
        if (!secure_slot_in_range(slot)) {
            secure_finish(&s->els, MM_FALSE);
            return;
        }
        secure_hmac(s->persist.slots[slot].key, s->cdi, 32u, msg, 16u);
        s->persist.slots[slot].valid = MM_TRUE;
        s->persist.slots[slot].permissions = 0xFFFFFFFFu;
        secure_regs_writeback(&s->els, s->persist.slots[slot].key);
        secure_finish(&s->els, MM_TRUE);
        return;
    case ELS_CMD_IMPORT:
    {
        mm_u8 tail[32];
        if (!secure_slot_in_range(slot)) {
            secure_finish(&s->els, MM_FALSE);
            return;
        }
        memcpy(s->persist.slots[slot].key + 0u, &s->els.keyin[0], 4u);
        memcpy(s->persist.slots[slot].key + 4u, &s->els.keyin[1], 4u);
        memcpy(s->persist.slots[slot].key + 8u, &s->els.keyin[2], 4u);
        memcpy(s->persist.slots[slot].key + 12u, &s->els.keyin[3], 4u);
        secure_mix_label(tail, s->persist.slots[slot].key, "els-import", slot, 0u);
        memcpy(s->persist.slots[slot].key + 16u, tail, 16u);
        s->persist.slots[slot].valid = MM_TRUE;
        s->persist.slots[slot].permissions = 0xFFFFFFFFu;
        secure_regs_writeback(&s->els, s->persist.slots[slot].key);
        secure_finish(&s->els, MM_TRUE);
        return;
    }
    case ELS_CMD_SIGN:
        if (!secure_els_sign_from_slot(slot, msg, 16u, sig)) {
            secure_finish(&s->els, MM_FALSE);
            return;
        }
        secure_regs_writeback(&s->els, sig);
        secure_finish(&s->els, MM_TRUE);
        return;
    case ELS_CMD_VERIFY:
        if (!secure_els_sign_from_slot(slot, msg, 16u, sig)) {
            secure_finish(&s->els, MM_FALSE);
            return;
        }
        if (memcmp(sig, &s->els.data[0], 16u) == 0 &&
            memcmp(sig + 16u, &s->els.result[0], 16u) == 0) {
            s->els.result[0] = 1u;
            secure_finish(&s->els, MM_TRUE);
        } else {
            s->els.result[0] = 0u;
            secure_finish(&s->els, MM_FALSE);
        }
        return;
    case ELS_CMD_ATTEST:
        if (!mm_mcxn947_secure_attest(&blob)) {
            secure_finish(&s->els, MM_FALSE);
            return;
        }
        s->els.result[0] = read32le(blob.measurement + 0u);
        s->els.result[1] = read32le(blob.measurement + 4u);
        s->els.result[2] = read32le(blob.measurement + 8u);
        s->els.result[3] = read32le(blob.measurement + 12u);
        s->els.data[0] = read32le(blob.signature + 0u);
        s->els.data[1] = read32le(blob.signature + 4u);
        s->els.data[2] = read32le(blob.signature + 8u);
        s->els.data[3] = read32le(blob.signature + 12u);
        secure_finish(&s->els, MM_TRUE);
        return;
    case ELS_CMD_RNG:
        mm_mcxn947_secure_rng_fill((mm_u8 *)sig, sizeof(sig));
        secure_regs_writeback(&s->els, sig);
        secure_finish(&s->els, MM_TRUE);
        return;
    default:
        break;
    }
    secure_finish(&s->els, MM_FALSE);
}

