imbluedabr/m33mu/cpu/mcxn947/mcxn947_secure.c
static void secure_exec_pkc(struct mcxn947_secure_state *s)
{
    mm_u8 msg[32];
    mm_u8 sig[32];
    memset(msg, 0, sizeof(msg));
    write32le(msg + 0u, s->pkc.keyin[0]);
    write32le(msg + 4u, s->pkc.keyin[1]);
    write32le(msg + 8u, s->pkc.keyin[2]);
    write32le(msg + 12u, s->pkc.keyin[3]);
    switch (s->pkc.cmd) {
    case PKC_CMD_KEYGEN:
        secure_regs_writeback(&s->pkc, s->attest_pubkey);
        secure_finish(&s->pkc, MM_TRUE);
        return;
    case PKC_CMD_SIGN:
        secure_hmac(sig, s->cdi, 32u, msg, 16u);
        secure_regs_writeback(&s->pkc, sig);
        secure_finish(&s->pkc, MM_TRUE);
        return;
    case PKC_CMD_VERIFY:
        secure_hmac(sig, s->cdi, 32u, msg, 16u);
        s->pkc.result[0] = (memcmp(sig, &s->pkc.data[0], 16u) == 0 &&
                            memcmp(sig + 16u, &s->pkc.result[1], 12u) == 0) ? 1u : 0u;
        secure_finish(&s->pkc, s->pkc.result[0] ? MM_TRUE : MM_FALSE);
        return;
    default:
        break;
    }
    secure_finish(&s->pkc, MM_FALSE);
}

static void secure_exec_otpc(struct mcxn947_secure_state *s)
{
    mm_u32 index;
    index = s->otpc.arg[0];
    if (index >= MCXN947_OTP_WORDS) {
        secure_finish(&s->otpc, MM_FALSE);
        return;
    }
    if (s->otpc.cmd != OTPC_CMD_PROGRAM) {
        secure_finish(&s->otpc, MM_FALSE);
        return;
    }
    s->persist.otp[index] |= s->otpc.arg[1];
    if (index == 25u) {
        secure_refresh_identity(s);
    }
    s->otpc.result[0] = s->persist.otp[index];
    secure_finish(&s->otpc, MM_TRUE);
}

static void secure_exec_prince(struct mcxn947_secure_state *s)
{
    if (s->prince.cmd != PRINCE_CMD_CONFIG) {
        secure_finish(&s->prince, MM_FALSE);
        return;
    }
    s->persist.otp[26] = s->prince.arg[0];
    s->persist.otp[27] = s->prince.arg[1];
    s->prince.result[0] = s->persist.otp[26];
    s->prince.result[1] = s->persist.otp[27];
    secure_finish(&s->prince, MM_TRUE);
}

static void secure_exec(enum mcxn947_secure_block block)
{
    switch (block) {
    case MCXN947_BLOCK_PUF:
        secure_exec_puf(&g_sec);
        break;
    case MCXN947_BLOCK_OTPC:
        secure_exec_otpc(&g_sec);
        break;
    case MCXN947_BLOCK_ELS:
        secure_exec_els(&g_sec);
        break;
    case MCXN947_BLOCK_PKC:
        secure_exec_pkc(&g_sec);
        break;
    case MCXN947_BLOCK_PRINCE:
        secure_exec_prince(&g_sec);
        break;
    default:
        break;
    }
}

static mm_bool secure_access_ok(void)
{
    return (mmio_active_sec() == MM_SECURE) ? MM_TRUE : MM_FALSE;
}

static mm_bool secure_read_words(struct mcxn947_secure_regs *r, mm_u32 offset,
                                 mm_u32 size_bytes, mm_u32 *value_out)
{
    if (size_bytes != 4u || value_out == 0) return MM_FALSE;
    switch (offset) {
    case SEC_REG_CMD: *value_out = r->cmd; return MM_TRUE;
    case SEC_REG_STATUS: *value_out = r->status; return MM_TRUE;
    case SEC_REG_ARG0: *value_out = r->arg[0]; return MM_TRUE;
    case SEC_REG_ARG1: *value_out = r->arg[1]; return MM_TRUE;
    case SEC_REG_ARG2: *value_out = r->arg[2]; return MM_TRUE;
    case SEC_REG_ARG3: *value_out = r->arg[3]; return MM_TRUE;
    case SEC_REG_RESULT0: *value_out = r->result[0]; return MM_TRUE;
    case SEC_REG_RESULT1: *value_out = r->result[1]; return MM_TRUE;
    case SEC_REG_RESULT2: *value_out = r->result[2]; return MM_TRUE;
    case SEC_REG_RESULT3: *value_out = r->result[3]; return MM_TRUE;
    case SEC_REG_KEYIN0: *value_out = r->keyin[0]; return MM_TRUE;
    case SEC_REG_KEYIN1: *value_out = r->keyin[1]; return MM_TRUE;
    case SEC_REG_KEYIN2: *value_out = r->keyin[2]; return MM_TRUE;
    case SEC_REG_KEYIN3: *value_out = r->keyin[3]; return MM_TRUE;
    case SEC_REG_DATA0: *value_out = r->data[0]; return MM_TRUE;
    case SEC_REG_DATA1: *value_out = r->data[1]; return MM_TRUE;
    case SEC_REG_DATA2: *value_out = r->data[2]; return MM_TRUE;
    case SEC_REG_DATA3: *value_out = r->data[3]; return MM_TRUE;
    default:
        break;
    }
    return MM_FALSE;
}

static mm_bool secure_region_read(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                                  mm_u32 *value_out)
{
    struct mcxn947_secure_regs *r;
    mm_u32 idx;
    if (!secure_access_ok()) return MM_FALSE;
    r = (struct mcxn947_secure_regs *)opaque;
    if (r == 0) return MM_FALSE;
    if (secure_read_words(r, offset, size_bytes, value_out)) return MM_TRUE;
    if (r == &g_sec.otpc && size_bytes == 4u &&
        offset >= SEC_REG_DATA0 && offset < (SEC_REG_DATA0 + MCXN947_OTP_WORDS * 4u)) {
        idx = (offset - SEC_REG_DATA0) / 4u;
        if (idx < MCXN947_OTP_WORDS) {
            *value_out = g_sec.persist.otp[idx];
            return MM_TRUE;
        }
    }
    return MM_FALSE;
}

static mm_bool secure_region_write(void *opaque, mm_u32 offset, mm_u32 size_bytes,
                                   mm_u32 value)
{
    struct mcxn947_secure_regs *r;
    enum mcxn947_secure_block block;
    if (!secure_access_ok()) return MM_FALSE;
    if (size_bytes != 4u) return MM_FALSE;
    r = (struct mcxn947_secure_regs *)opaque;
    if (r == 0) return MM_FALSE;
    if (r == &g_sec.puf) block = MCXN947_BLOCK_PUF;
    else if (r == &g_sec.otpc) block = MCXN947_BLOCK_OTPC;
    else if (r == &g_sec.els) block = MCXN947_BLOCK_ELS;
    else if (r == &g_sec.pkc) block = MCXN947_BLOCK_PKC;
    else block = MCXN947_BLOCK_PRINCE;

    switch (offset) {
    case SEC_REG_CMD:
        r->cmd = value;
        r->status |= SEC_STATUS_BUSY;
        r->status &= ~(SEC_STATUS_DONE | SEC_STATUS_ERROR);
        secure_exec(block);
        return MM_TRUE;
    case SEC_REG_STATUS:
        r->status &= ~value;
        return MM_TRUE;
    case SEC_REG_ARG0: r->arg[0] = value; return MM_TRUE;
    case SEC_REG_ARG1: r->arg[1] = value; return MM_TRUE;
    case SEC_REG_ARG2: r->arg[2] = value; return MM_TRUE;
    case SEC_REG_ARG3: r->arg[3] = value; return MM_TRUE;
    case SEC_REG_KEYIN0: r->keyin[0] = value; return MM_TRUE;
    case SEC_REG_KEYIN1: r->keyin[1] = value; return MM_TRUE;
    case SEC_REG_KEYIN2: r->keyin[2] = value; return MM_TRUE;
    case SEC_REG_KEYIN3: r->keyin[3] = value; return MM_TRUE;
    case SEC_REG_DATA0: r->data[0] = value; return MM_TRUE;
    case SEC_REG_DATA1: r->data[1] = value; return MM_TRUE;
    case SEC_REG_DATA2: r->data[2] = value; return MM_TRUE;
    case SEC_REG_DATA3: r->data[3] = value; return MM_TRUE;
    default:
        break;
    }
    return MM_FALSE;
}

static mm_bool secure_register_pair(struct mmio_bus *bus, mm_u32 base,
                                    struct mcxn947_secure_regs *regs)
{
    struct mmio_region reg;
    memset(&reg, 0, sizeof(reg));
    reg.base = base;
    reg.size = MCXN947_SEC_SIZE;
    reg.opaque = regs;
    reg.read = secure_region_read;
    reg.write = secure_region_write;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    reg.base = base + MCXN947_SEC_ALIAS;
    if (!mmio_bus_register_region(bus, &reg)) return MM_FALSE;
    return MM_TRUE;
}

void mm_mcxn947_secure_reset(void)
{
    secure_build_defaults(&g_sec);
    secure_reset_regs(&g_sec.puf);
    secure_reset_regs(&g_sec.otpc);
    secure_reset_regs(&g_sec.els);
    secure_reset_regs(&g_sec.pkc);
    secure_reset_regs(&g_sec.prince);
    g_sec.puf.status |= SEC_STATUS_DONE;
    g_sec.otpc.status |= SEC_STATUS_DONE;
    g_sec.els.status |= SEC_STATUS_DONE;
    g_sec.pkc.status |= SEC_STATUS_DONE;
    g_sec.prince.status |= SEC_STATUS_DONE;
    g_sec.otpc.result[0] = g_sec.persist.otp[0];
    g_sec.prince.result[0] = g_sec.persist.otp[26];
    g_sec.prince.result[1] = g_sec.persist.otp[27];
    g_sec.puf_enrolled = MM_TRUE;
    secure_refresh_identity(&g_sec);
}

mm_bool mm_mcxn947_secure_register_mmio(struct mmio_bus *bus)
{
    if (bus == 0) return MM_FALSE;
    if (!secure_register_pair(bus, MCXN947_PUF_BASE, &g_sec.puf)) return MM_FALSE;
    if (!secure_register_pair(bus, MCXN947_OTPC_BASE, &g_sec.otpc)) return MM_FALSE;
    if (!secure_register_pair(bus, MCXN947_ELS_BASE, &g_sec.els)) return MM_FALSE;
    if (!secure_register_pair(bus, MCXN947_PKC_BASE, &g_sec.pkc)) return MM_FALSE;
    if (!secure_register_pair(bus, MCXN947_PRINCE_BASE, &g_sec.prince)) return MM_FALSE;
    return MM_TRUE;
}

void mm_mcxn947_secure_flash_bind(struct mm_memmap *map,
                                  mm_u8 *flash,
                                  mm_u32 flash_size,
                                  const struct mm_flash_persist *persist,
                                  mm_u32 flags)
{
    (void)map;
    (void)persist;
    (void)flags;
    g_sec.flash = flash;
    g_sec.flash_size = flash_size;
    secure_refresh_identity(&g_sec);
}

