imbluedabr/m33mu/cpu/mcxn947/mcxn947_secure.c
mm_bool mm_mcxn947_secure_otp_read(mm_u32 index, mm_u32 *value_out)
{
    if (value_out == 0 || index >= MCXN947_OTP_WORDS) return MM_FALSE;
    *value_out = g_sec.persist.otp[index];
    return MM_TRUE;
}

mm_bool mm_mcxn947_secure_otp_program(mm_u32 index, mm_u32 value)
{
    if (index >= MCXN947_OTP_WORDS) return MM_FALSE;
    g_sec.persist.otp[index] |= value;
    if (index == 25u) secure_refresh_identity(&g_sec);
    return MM_TRUE;
}

void mm_mcxn947_secure_rng_fill(mm_u8 *out, mm_u32 len)
{
    mm_u8 block[32];
    mm_u32 pos;
    mm_u32 chunk;
    if (out == 0) return;
    pos = 0u;
    while (pos < len) {
        secure_mix_label(block, g_sec.persist.uds, "rng", g_sec.att_seed, g_sec.nonce++);
        chunk = len - pos;
        if (chunk > sizeof(block)) chunk = sizeof(block);
        memcpy(out + pos, block, chunk);
        pos += chunk;
    }
}

mm_bool mm_mcxn947_secure_els_clock_ready(void)
{
    return mm_mcxn947_syscon_clock_bit_on(0x200u, 25u) &&
           mm_mcxn947_syscon_reset_bit_released(0x100u, 25u);
}

mm_bool mm_mcxn947_secure_rom_call_allowed(enum mm_sec_state sec)
{
    return (sec == MM_SECURE) ? MM_TRUE : MM_FALSE;
}

enum mcxn947_lifecycle_state mm_mcxn947_secure_lifecycle(void)
{
    return (enum mcxn947_lifecycle_state)(g_sec.lifecycle & 0x3u);
}

mm_bool mm_mcxn947_secure_measurement(mm_u8 out[32])
{
    if (out == 0) return MM_FALSE;
    secure_refresh_identity(&g_sec);
    memcpy(out, g_sec.measurement, 32u);
    return MM_TRUE;
}

mm_bool mm_mcxn947_secure_attest(struct mcxn947_attestation_blob *blob_out)
{
    if (blob_out == 0) return MM_FALSE;
    secure_refresh_identity(&g_sec);
    memcpy(blob_out->measurement, g_sec.measurement, 32u);
    memcpy(blob_out->cdi, g_sec.cdi, 32u);
    memcpy(blob_out->pubkey, g_sec.attest_pubkey, 32u);
    memcpy(blob_out->signature, g_sec.attest_sig, 32u);
    return MM_TRUE;
}
